# üö© DataFrameÏóê ÎåÄÌï¥ÏÑú
## Ï£ºÏöî ÌÜ†ÌîΩ
1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í∏∞Ï¥à
2. Îç∞Ïù¥ÌÑ∞ Ï†ëÍ∑º Î∞è Ï†úÍ±∞
3. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í≤∞Ï∏°Í∞í
4. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï†ïÎ†¨Í≥º ÌïÑÌÑ∞ÎßÅ
5. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº ÏàòÏ†ï
6. ÌåêÎã§Ïä§ Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ
7. Î©îÎ™®Î¶¨ ÏµúÏ†ÅÌôî
## Î™©Ìëú
- Ìñâ ÌïÑÌÑ∞ÎßÅ/Ï†ïÎ†¨, Í≤∞Ï∏°Í∞í Ï≤òÎ¶¨, ÏÉàÎ°úÏö¥ Ïª¨Îüº Ï∂îÍ∞Ä, Ïª¨ÎüºÏóê Ìï®Ïàò Ï†ÅÏö©ÌïòÍ∏∞

In [1]:
import numpy as np
import pandas as pd

## 1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏù¥ÎûÄ?
- Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò Ïó¥ÏùÄ ÌïòÎÇòÏùò SeriesÏù¥Îã§
    - Í∞Å Ïª¨ÎüºÏùÄ ÎèôÏùºÌïú Ìñâ Ïù∏Îç±Ïä§Î•º Í≥µÏú†ÌïúÎã§.
    - Í∞Å Ïª¨ÎüºÎ™Ö = column index. Series name ÏÜçÏÑ±Í∞íÏùÑ Ìè¨Ìï®ÌïúÎã§.
### > Ï£ºÏöî ÏÜçÏÑ±
1. shape
2. index (Ìñâ Ïù∏Îç±Ïä§)
3. columns
4. axes (ÌñâÍ≥º Ïó¥Ïùò Ïù∏Îç±Ïä§)
5. dtypes (Í∞Å SeriesÏùò Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ)

In [2]:
oil = pd.read_csv('./data/retail/oil.csv')
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [3]:
oil.shape

(1218, 2)

In [4]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['date', 'dcoilwtico'], dtype='object')]

In [5]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [6]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [7]:
oil.columns = ['price_date', 'oil_price']
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

### > Ï£ºÏöî Î©îÏÑúÎìú
1. head, tail
2. sample (ÏûÑÏùòÏùò Ìñâ Îç∞Ïù¥ÌÑ∞ Ï∂îÏ∂ú)
3. info (Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í∏∞Î≥∏ Ï†ïÎ≥¥)
4. describe (Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò ÌÜµÍ≥Ñ Ï†ïÎ≥¥; ONLY numeric columns BY DEFAULT)

In [8]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [9]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1218 non-null   object
 1   oil_price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [10]:
oil.describe()

         oil_price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [11]:
oil.describe(include='all')

        price_date    oil_price
count         1218  1175.000000
unique        1218          NaN
top     2013-01-01          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000